In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_json('data.json')
df.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130       NaN
1        60    117       145       NaN

In [3]:
x = df["Calories"].mean()
df["Calories"].fillna(x, inplace = True)
df.head(2)

   Duration  Pulse  Maxpulse    Calories
0        60    110       130  375.174534
1        60    117       145  375.174534

In [4]:
df = pd.read_csv('pandas_practice.csv')
print(df.loc[9999].Gender)

Female

In [5]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}
myvar = pd.DataFrame(mydataset).fillna(np.NaN)
myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [6]:
a = np.arange(5,10)
srs = pd.Series(a)
srs

0    5
1    6
2    7
3    8
4    9
dtype: int32

In [7]:
srs = pd.Series(a,index=['a','b','c','d','e'])
srs

a    5
b    6
c    7
d    8
e    9
dtype: int32

In [8]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
myvar

day1    420
day2    380
day3    390
dtype: int64

In [9]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories, index = ["day1", "day2"])
myvar

day1    420
day2    380
dtype: int64

In [10]:
CMX = [2,3,4]
Size = [3,7,8]
arr_csv = pd.DataFrame(np.transpose(np.array([CMX,Size])),index=[i for i in range(len(Size))],columns=['CMX','Size'])
arr_csv.to_csv('pandas_practice_np_to_df.csv',index='False')
arr_csv

   CMX  Size
0    2     3
1    3     7
2    4     8

In [11]:
import pandas as pd
import os
for i in os.listdir(r'python'):
    df = pd.read_csv(os.path.join(r'python',i))
    df['file_id'] = i
    # df2 = pd.read_csv(r'x.csv')
    # merge = pd.merge(df,df2)
    merge_csv = pd.merge(merge_csv,df)

FileNotFoundError: [WinError 3] The system cannot find the path specified: 'python'

In [ ]:
import pandas as pd
import os
merge_csv = []
for i in os.listdir(r'pandas_practice'):
    df = pd.read_csv(os.path.join(r'pandas_practice',i))
    merge_csv.append(df)
pd.concat(merge_csv)

     Gender  Height      Weight
0      Male     NaN         NaN
1      Male     NaN         NaN
2      Male     NaN         NaN
3      Male     NaN         NaN
4      Male     NaN         NaN
...     ...     ...         ...
9995    NaN     NaN  136.777454
9996    NaN     NaN  170.867906
9997    NaN     NaN  128.475319
9998    NaN     NaN  163.852461
9999    NaN     NaN  113.649103

[30000 rows x 3 columns]

In [12]:
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata',
								'Mahindra', 'Maruti', 'Hyundai',
								'Renault', 'Tata', 'Maruti'],
					'Year' : [2012, 2014, 2011, 2015, 2012,
							2016, 2014, 2018, 2019],
					'Kms Driven' : [50000, 30000, 60000,
									25000, 10000, 46000,
									31000, 15000, 12000],
					'City' : ['Gurgaon', 'Delhi', 'Mumbai',
							'Delhi', 'Mumbai', 'Delhi',
							'Mumbai','Chennai', 'Ghaziabad'],
					'Mileage' : [28, 27, 25, 26, 28,
								29, 24, 21, 24]})

In [16]:
data.iloc[[0, 2, 4, 7]]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
2    Tata  2011       60000   Mumbai       25
4  Maruti  2012       10000   Mumbai       28
7    Tata  2018       15000  Chennai       21

In [14]:
data.iloc[1 : 5, 2 : 5]

   Kms Driven    City  Mileage
1       30000   Delhi       27
2       60000  Mumbai       25
3       25000   Delhi       26
4       10000  Mumbai       28